<template>
	<div id="subService">
		<div v-for="(item, i) in subServiceContent" :key="i" v-if="currentSubService === ''">
			<h6 :id="i" @click="selectSubService($event)" v-html="item.title"></h6>
		</div>
		<div v-if="itemContent !== '' && currentSubService !== ''">
			<h6 @click="artistsBack">Назад</h6>
			<h5 v-html="itemTitle"></h5>
			<p v-html="itemContent"></p>
		</div>
	</div>
</template>

<script>

	export default {
		props: {
			currentService: {type: String, required: true},
			currentSubService: {type: String, required: true}
		},
		data() {
			return {
				serviceAdultArtist: [{
						name: 'aquagrim',
						title: 'Аквагрим',
						content: 'Аквагрим – неотъемлемая часть яркого праздника: и детского торжества, и взрослой вечеринки. Не упустите возможность добавить в жизнь красок и позитивного настроя!'
					},{
						name: 'acrobaticShow',
						title: 'Акработические шоу',
						content: 'Прекрасные и невероятно гибкие и ловкие девушки и юноши способны вызвать восторг практически у любого, даже искушенного зрителя.'
					},{
						name: 'paperShow',
						title: 'Бумажное шоу',
						content: 'Наше бумажное шоу способно превратить любое мероприятие в стильный и невероятно озорной праздник искренних счастливых эмоций.'
					},{
						name: 'girl',
						title: 'Девушка-поднос',
						content: 'Такое «блюдо» непременно привнесет элемент пикантности в любой мальчишник.'
					},{
						name: 'monuments',
						title: 'Живые статуи',
						content: 'Древнегреческие, средневековые, ренессансные и даже советские скульптуры оживут у вас на глазах.'
					},{
						name: 'cryoShow',
						title: 'Крио шоу',
						content: 'Поразите ваших гостей мистическим необычным ледяным шоу.'
					},{
						name: 'laserShow',
						title: 'Лазерное шоу, лаземен',
						content: 'Лазерные лучи на празднике – это не только шикарные декорации, но и потрясающий комфорт для гостей: именно в таком освещении человек может танцевать и расслабляться, не задумываясь о том, как выглядит для окружающих. В свете лазеров все выглядят королями вечеринок!'
					},{
						name: 'lasertag',
						title: 'Лазертаг',
						content: 'Вычислить противника  раньше, чем он тебя, и поразить метким выстрелом! Азарт, эмоции, командная работа, - и никаких синяков и ссадин  от  попаданий по незащищенным участкам тела. Это будет ЛЕГЕНДАРНО!'
					},{
						name: 'bomberball',
						title: 'Бомпербол',
						content: 'Играть в футбол – весело. Но еще веселее – когда при этом ты сам похож на шар!'
					},{
						name: 'mims',
						title: 'Мимы',
						content: 'Мимы – это очень стильные и талантливые ребята. Лицо способно выразить любые эмоции, а каждая поза выразительна. Они очаруют и заставят смеяться даже самого взыскательного зрителя, а детей приведут в настоящий восторг!'
					},{
						name: 'scientificShow',
						title: 'Научное шоу',
						content: 'Научные шоу – один из лучших способов привить ребенку любовь к науке. Харизматичные молодые ученые проведут серию зрелищных экспериментов: зрители узнают массу нового и интересного.'
					},{
						name: 'neonShow',
						title: 'Неоновое шоу',
						content: 'Потрясающее профессиональное шоу - игра света и теней: мистическое, креативное, загадочное, вдохновенное.'
					},{
						name: 'fireShow',
						title: 'Огненное шоу',
						content: 'Восхитительное шоу огня, оформленное в этно-стиле, не оставит никого равнодушным.'
					},{
						name: 'sandShow',
						title: 'Песочное шоу',
						content: 'Завораживающий процесс создания хрупкого шедевра, Песок оживает у вас на глазах, рассыпается, и снова преображается, приобретая причудливые очертания и маня мечтателей и романтиков…'
					},{
						name: 'portrets',
						title: 'Портреты блестками',
						content: 'Портрет дорогих людей в эксклюзивном исполнении – прекрасная идея для любого радостного повода!'
					},{
						name: 'sandPainting',
						title: 'Рисование на песке',
						content: 'Рисования песком для детей и взрослых на любой праздник! Оно расскажет о самых ярких моментах жизни и принесет море положительных эмоций.'
					},{
						name: 'lightPictures',
						title: 'Световые картины',
						content: 'Завораживающие  истории, рассказанные светом, останутся в памяти надолго.'
					},{
						name: 'danceGroups',
						title: 'Танцевальные коллективы',
						content: 'Выступления танцевальных коллективов станут настоящим подарком для всех гостей. Красота, вдохновение, ловкость, гибкость и изящество танцоров украсят праздник и вдохновят собравшихся на покорение танцпола!'
					},{
						name: 'musicalGroups',
						title: 'Музыкальные коллективы',
						content: 'Выступления танцевальных коллективов станут настоящим подарком для всех гостей. Красота, вдохновение, ловкость, гибкость и изящество танцоров украсят праздник и вдохновят собравшихся на покорение танцпола!'
					},{
						name: 'teslaShow',
						title: 'Тесла шоу',
						content: 'У вас есть шанс почувствовать себя настоящим экспериментатором и изобретателем, ведь это шоу - на гране науки и волшебства.'
					},{
						name: 'magician',
						title: 'Фокусник',
						content: 'Нам нельзя применять магию вне Хогвартса, но тсс, – для вас мы сделаем исключение: это будут магические трюки для искушенного зрителя.'
					},{
						name: 'stilts',
						title: 'Ходулисты',
						content: 'Их невозможно не заметить! В любой толпе они будет выше всех, и ярче всех! Необычное и очень эффектное украшение праздников – прекрасные акробаты-ходулисты.'
					},{
						name: 'flower',
						title: 'Цветок лотос',
						content: 'Мы сделаем ваше появление перед гостями и зрителями незабываемым, волшебным и красивым, как сияющий цветок лотоса.<br><br>Жених и невеста эффектно появятся из прекрасного раскрывающегося цветка. Этот торжественный момент мы украсим танцем нимф и ярким конфетти или дымовыми эффектами.'
					},{
						name: 'springMan',
						title: 'Человек пружина',
						content: 'Отгадайте загадку: что такое - веселое, гибкое, радужное, изумительное, невероятное?  Не знаете?<br><br>Это наш человек-пружина!'
					},{
						name: 'bubbleShow',
						title: 'Шоу гигантских <br> мыльных пузырей',
						content: 'Помните свою детскую радость, когда родители покупают флакончик мыльных пузырей? А представьте, если пузырей много? И они большие, или даже огромные, настолько, что потрясают воображение?   А  еще это зрелище будет сопровождаться фокусами с огнем и дымом?<br>Искренняя радость всех гостей вечеринки обеспечена!<br>И бонус: каждый сможет побыть в гигантском воздушном пузыре.'
					}],
				serviceAdultTable: [{
						name: 'candybar',
						title: 'Кендибар',
						content: 'Выпечка и сладости для вашего праздника должны быть не только вкусными, но и красивыми и уникальными. Кексы и капкейки, конфеты, печенье, зефир – все изготовят по вашему индивидуальному заказу.'
					},{
						name: 'catering',
						title: 'Кейтеринг',
						content: 'Сложно представить себе хорошо организованное торжество без качественного выездного обслуживания. Где бы ни проходили ваш банкет, презентация, день рождения, корпоратив или свадьба, мы поможем вам обеспечить уровень хорошего ресторана.'
					},{
						name: 'lady',
						title: 'Леди-фуршет',
						content: 'Эта идея для вас, если праздник проходит в просторном помещении или на открытом воздухе. Леди-фуршет – девушка, стоящая в центре красиво декорированного стола, уставленного изящно сервированными закусками и фруктами или напитками. Ее наряд, составляющий единое целое с декором стола, может быть любым, по вашему желанию.'
					},{
						name: 'girl',
						title: 'Девушка-поднос',
						content: 'Фруктовая или другая нарезка, закуски и суши подаются сервированными на… теле красивой полуобнаженной или обнаженной девушки. В Японии девушки, на чьих телах подат суши, называются ниотамори.'
					},{
						name: 'champagne',
						title: 'Горка с шампанским',
						content: 'Красивая пирамида из бокалов с шампанским станет эффектным центром внимания любого банкета и воплощением торжественности праздника. А ее наполнение и угощений гостей – настоящее шоу в руках хорошего бармена.'
					},{
						name: 'popcorn',
						title: 'Попкорн',
						content: 'Попкорн – традиционный соленый или сладкий, с разными вкусами (шоколад, карамель, клубника, вишня и др.), разноцветный, в ярких стаканчиках – это не просто лакомство, но и украшение вашего праздника!'
					},{
						name: 'cottonCandy',
						title: 'Сахарная вата',
						content: 'Разноцветная сладкая вата – вкусное напоминание о детстве. А сам процесс приготовления этого лакомства просто завораживает… А ведь когда ее изобрели в XV веке в Италии, сладкая вата была доступна только аристократам.'
					},{
						name: 'chokoFountain',
						title: 'Фонтан с бельгийским',
						content: 'Ваши гости будут лакомиться кусочками фруктов, зефиром или печеньем, обмакивая его в растопленный шоколад, молочный, белый или горький… Что может быть лучше! А еще шоколадный фонтан – это очень красиво.'
					},{
						name: 'juiceFountain',
						title: 'Фонтан с соком',
						content: 'Вместо привычных бутылок, графинов и кувшинов на вашем столе будет настоящий фонтан из сока, лимонада или вина. Такой фонтан украсит любой праздничный стол.'
					},{
						name: 'cakes',
						title: 'Торты',
						content: 'Красивый праздничный торт, изготовленный специально по вашему заказу, будет оформлен в стилистике мероприятия. Как он будет выглядеть, зависит только от вашей фантазии. И конечно же, он будет очень вкусным!'
					},{
						name: 'cupcakes',
						title: 'Капкейки',
						content: 'Маленькие, красивые и очень вкусные свежие капкейки. С любым кремом, ягодами или фруктами, декорированные на ваш вкус и специально к вашему празднику – они станут отличным украшением вашего стола.'
					},{
						name: 'apples',
						title: 'Яблоки в карамели и шоколаде',
						content: 'Вкуснейшее мягкое мороженое, с различными топингами и добавками – лучший десерт для вашего праздника. А его цвет или декор могут соответствовать тематике торжества.'
					},{
						name: 'icecream',
						title: 'Мороженое',
						content: 'Спелые, сладкие ароматные яблоки в блестящей «обертке» из карамели или шоколада… Нарядное и очень вкусное лакомство – совсем как в кино, на ярмарке или веселом карнавале!'
					},{
						name: 'fruits',
						title: 'Фруктовые композиции',
						content: 'Мы создадим изящные композиции из красиво нарезанных фруктов. Кусочки фруктов, уложенные в виде фигурной пирамиды, сердца, корзины, корабля, сказочной птицы или букета цветов…'
					},{
						name: 'bouquets',
						title: 'Букеты из конфет',
						content: 'Вкусные конфеты с разнообразными начинками, собранные в затейливый красивый букет, украшенный лентами, бусинами, кружевом – замечательный подарок и украшение праздничного стола.'
					},{
						name: 'caramel',
						title: 'Карамель на палочках',
						content: 'Карамель на палочке – круглая и разноцветная, сердечки или «трости», или фигурки животных… Яркая красивая и вкусная карамель словно вернет вас в детство.'
					},{
						name: 'cones',
						title: 'Кедровые шишечки',
						content: 'Настоящие кедровые шишки – оригинальный, вкусный и очень полезный презент для гостей и одновременно украшение вашего праздника. А еще – отличный подарочек от Деда Мороза на Новый год для детей.'
					}],
				serviceChildArtist: [{
						name: 'acrobaticShow',
						title: 'Акработические шоу',
						content: 'Прекрасные и невероятно гибкие и ловкие девушки и юноши способны вызвать восторг практически у любого, даже искушенного зрителя.'
					},{
						name: 'paperShow',
						title: 'Бумажное шоу',
						content: 'Наше бумажное шоу способно превратить любое мероприятие в стильный и невероятно озорной праздник искренних счастливых эмоций.'
					},{
						name: 'monuments',
						title: 'Живые статуи',
						content: 'Древнегреческие, средневековые, ренессансные и даже советские скульптуры оживут у вас на глазах.'
					},{
						name: 'cryoShow',
						title: 'Крио шоу',
						content: 'Поразите ваших гостей мистическим необычным ледяным шоу.'
					},{
						name: 'laserShow',
						title: 'Лазерное шоу, лаземен',
						content: 'Лазерные лучи на празднике – это не только шикарные декорации, но и потрясающий комфорт для гостей: именно в таком освещении человек может танцевать и расслабляться, не задумываясь о том, как выглядит для окружающих. В свете лазеров все выглядят королями вечеринок!'
					},{
						name: 'lasertag',
						title: 'Лазертаг',
						content: 'Вычислить противника  раньше, чем он тебя, и поразить метким выстрелом! Азарт, эмоции, командная работа, - и никаких синяков и ссадин  от  попаданий по незащищенным участкам тела. Это будет ЛЕГЕНДАРНО!'
					},{
						name: 'bomberball',
						title: 'Бомпербол',
						content: 'Играть в футбол – весело. Но еще веселее – когда при этом ты сам похож на шар!'
					},{
						name: 'mims',
						title: 'Мимы',
						content: 'Мимы – это очень стильные и талантливые ребята. Лицо способно выразить любые эмоции, а каждая поза выразительна. Они очаруют и заставят смеяться даже самого взыскательного зрителя, а детей приведут в настоящий восторг!'
					},{
						name: 'scientificShow',
						title: 'Научное шоу',
						content: 'Научные шоу – один из лучших способов привить ребенку любовь к науке. Харизматичные молодые ученые проведут серию зрелищных экспериментов: зрители узнают массу нового и интересного.'
					},{
						name: 'neonShow',
						title: 'Неоновое шоу',
						content: 'Потрясающее профессиональное шоу - игра света и теней: мистическое, креативное, загадочное, вдохновенное.'
					},{
						name: 'fireShow',
						title: 'Огненное шоу',
						content: 'Восхитительное шоу огня, оформленное в этно-стиле, не оставит никого равнодушным.'
					},{
						name: 'sandShow',
						title: 'Песочное шоу',
						content: 'Завораживающий процесс создания хрупкого шедевра, Песок оживает у вас на глазах, рассыпается, и снова преображается, приобретая причудливые очертания и маня мечтателей и романтиков…'
					},{
						name: 'portrets',
						title: 'Портреты блестками',
						content: 'Портрет дорогих людей в эксклюзивном исполнении – прекрасная идея для любого радостного повода!'
					},{
						name: 'sandPainting',
						title: 'Рисование на песке',
						content: 'Рисования песком для детей и взрослых на любой праздник! Оно расскажет о самых ярких моментах жизни и принесет море положительных эмоций.'
					},{
						name: 'lightPictures',
						title: 'Световые картины',
						content: 'Завораживающие  истории, рассказанные светом, останутся в памяти надолго.'
					},{
						name: 'danceGroups',
						title: 'Танцевальные коллективы',
						content: 'Выступления танцевальных коллективов станут настоящим подарком для всех гостей. Красота, вдохновение, ловкость, гибкость и изящество танцоров украсят праздник и вдохновят собравшихся на покорение танцпола!'
					},{
						name: 'teslaShow',
						title: 'Тесла шоу',
						content: 'У вас есть шанс почувствовать себя настоящим экспериментатором и изобретателем, ведь это шоу - на гране науки и волшебства.'
					},{
						name: 'magician',
						title: 'Фокусник',
						content: 'Нам нельзя применять магию вне Хогвартса, но тсс, – для вас мы сделаем исключение: это будут магические трюки для искушенного зрителя.'
					},{
						name: 'stilts',
						title: 'Ходулисты',
						content: 'Их невозможно не заметить! В любой толпе они будет выше всех, и ярче всех! Необычное и очень эффектное украшение праздников – прекрасные акробаты-ходулисты.'
					},{
						name: 'springMan',
						title: 'Человек пружина',
						content: 'Отгадайте загадку: что такое - веселое, гибкое, радужное, изумительное, невероятное?  Не знаете?<br><br>Это наш человек-пружина!'
					},{
						name: 'bubbleShow',
						title: 'Шоу гигантских <br> мыльных пузырей',
						content: 'Помните свою детскую радость, когда родители покупают флакончик мыльных пузырей? А представьте, если пузырей много? И они большие, или даже огромные, настолько, что потрясают воображение?   А  еще это зрелище будет сопровождаться фокусами с огнем и дымом?<br>Искренняя радость всех гостей вечеринки обеспечена!<br>И бонус: каждый сможет побыть в гигантском воздушном пузыре.'
					}],
				serviceChildTable: [{
						name: 'candybar',
						title: 'Кендибар',
						content: 'Выпечка и сладости для детского праздника должны быть не только вкусными, но и красивыми. Оригинальные кексы и капкейки, конфеты, печенье, зефир обязательно понравятся вашим детям.'
					},{
						name: 'catering',
						title: 'Кейтеринг',
						content: 'Сложно представить себе хорошо организованное торжество без качественного выездного обслуживания. Где бы ни проходил ваш детский праздник, мы поможем вам обеспечить прекрасный уровень обслуживания.'
					},{
						name: 'popcorn',
						title: 'Попкорн',
						content: 'Попкорн – традиционный соленый или сладкий, с разными вкусами (шоколад, карамель, клубника, вишня и др.), разноцветный, в ярких стаканчиках – это излюбленное детское лакомство и украшение вашего праздника.'
					},{
						name: 'cottonCandy',
						title: 'Сахарная вата',
						content: 'Разноцветная сладкая вата – ее так любят дети! Процесс ее приготовления их просто завораживает… А ведь когда-то давно это лакомство могли позволить себе только самые богатые люди.'
					},{
						name: 'chokoFountain',
						title: 'Фонтан с бельгийским шоколадом',
						content: 'Детям очень понравится обмакивать кусочки фруктов, зефир или печенье в растопленный шоколад. Вкусное и красивое развлечение – что может быть лучше для детского праздника!'
					},{
						name: 'juiceFountain',
						title: 'Фонтан с соком и вином',
						content: 'Вместо привычных графинов и кувшинов на вашем столе будет настоящий фонтан из сока или лимонада, с подсветкой, брызгами и веселыми пузырьками. Такой фонтан украсит любой детский праздник.'
					},{
						name: 'cakes',
						title: 'Торты',
						content: 'Красивый праздничный торт, изготовленный специально по вашему заказу – центр внимания и украшение детского дня рождения или любого другого праздника. Как он будет выглядеть, зависит только от вашей фантазии. И конечно же, он будет очень вкусным!'
					},{
						name: 'cupcakes',
						title: 'Капкейки',
						content: 'Маленькие, красивые и очень вкусные свежие капкейки. С любым кремом, ягодами или фруктами, декорированные на ваш вкус и специально для вашего детского праздника – порадуют детей и станут отличным украшением стола.'
					},{
						name: 'apples',
						title: 'Яблоки в карамели и шоколаде',
						content: 'Спелые, сладкие ароматные яблоки в блестящей «обертке» из карамели или шоколада… Нарядное и очень вкусное лакомство – совсем как в кино, на ярмарке или веселом карнавале!'
					},{
						name: 'icecream',
						title: 'Мороженое',
						content: 'Вкуснейшее мягкое мороженое, с различными топингами и добавками – лучший десерт для вашего праздника. А его цвет или декор могут соответствовать тематике торжества.'
					},{
						name: 'fruits',
						title: 'Фруктовые композиции',
						content: 'Мы создадим изящные композиции из красиво нарезанных фруктов. Кусочки фруктов, уложенные в виде фигурной пирамиды, сердца, корзины, корабля, сказочной птицы или букета цветов…'
					},{
						name: 'bouquets',
						title: 'Букеты из конфет',
						content: 'Вкусные конфеты с разнообразными начинками, собранные в затейливый красивый букет, украшенный лентами, бусинами, кружевом – замечательный подарок и украшение праздничного стола.'
					},{
						name: 'caramel',
						title: 'Карамель на палочках',
						content: 'Карамель на палочке – круглые и разноцветные, сердечки или «трости», или фигурки животных… Яркая красивая и вкусная карамель обязательно понравится детям.'
					},{
						name: 'cones',
						title: 'Кедровые шишечки',
						content: 'Настоящие кедровые шишки – оригинальный, вкусный и очень полезный подарок для гостей и одновременно украшение вашего праздника. А еще – отличный подарочек от Деда Мороза на Новый год для детей.'
					}],
				itemTitle: '',
				itemContent: '',
			}
		},
		computed: {
			subServiceContent() {
				if (this.$route.name === 'adult') {
					if (this.currentService === 'artists') {
						return this.serviceAdultArtist
					} else {
						return this.serviceAdultTable
					}
				} else {
					if (this.currentService === 'artists') {
						return this.serviceChildArtist
					} else {
						return this.serviceChildTable
					}
				}
			}
		},
		methods: {
			selectSubService(e) {
				let index = e.target.getAttribute('id');
				this.itemContent = this.subServiceContent[index].content;
				this.itemTitle = this.subServiceContent[index].title;
				this.$emit('setCurrentSubService', this.subServiceContent[index].name);
			},
			artistsBack() {
				this.itemContent = '';
				this.$emit('setCurrentSubService', '');
			}
		}
	}

</script>

<style lang="scss">

	#subService {
	    max-height: 200px;
	    display: flex;
	    flex-direction: column;
	    flex-wrap: wrap;
		p {font-size: 0.8em}
	}

</style>