<template>
	<section :class="$route.name">
		<h2>Отзывы о нашей работе</h2>
		<slick ref="slick" :options="slickOptions">
			<div id="review" v-for="(review, i) in reviews">
				<img :src="reviewImg + i + '.jpg'" alt="reviewImg + i + '.jpg'">
				<p v-html="review"></p>
			</div>
		</slick>
	</section>
</template>

<script>

	import Slick from 'vue-slick';
	import 'slick-carousel/slick/slick.css';

	export default {
		components: { Slick },
		data() {
			return {
				slickOptions: {
					slidesToShow: 1,
					arrows:false,
					dots: true,
				},
				reviewImg: 'img/photo/'+this.$route.name+'-review-',
				reviewsAdult: ['Спасибо ОГРОМНОЕ Анастасии за проведение моего юбилейного дня рождения! Все мы остались очень довольны! Всем рекомендую. Ярко, весело, непринужденно! Удачи, процветания и побольше клиентов вам Анастасия!!!',
'Создание нашей семьи состоялось 14.09.2013 года) Безусловно всем хочется, чтобы этот день запомнился на всю жизнь и поэтому немаловажно уделить внимание ведущему данного мероприятия) Настенка подошла к этому вопросу ответственно, добросовестно и качественно)и нам безумно понравилось работать с ней!! Несомненно эта девушка просто золотце и умничка)все класс, все безупречно!!! нашей задачей было угодить и взрослым и молодежи....и УРА....это получилось....на нашем празднике царила обалденная атмосфера) и все всем понравилось!!! Хочу еще отметить, что с Настей легко сотрудничать! я оооч вредная(ахаххаа), но с Настенкой мы нашли общий язык) Так что будущие новобрачные....без каких-либо колебаний обращайтесь в ПаТи БуМ))) и Ваш праздник станет незабываемый!!) А тебе,Насть..еще раз отдельное спасибо и желаем тебе только процветания)',
'Анастасия наша семья хотела бы отблагодарить тебя за бесподобное проведение нашей СВАДЬБЫ!!! Этот день нам запомнился на всё жизнь, столько ты оставила впечатлений в наших сердцах.. столько радости и улыбок ты подарила нашим гостям, до сих пор вспоминаем с радостью.. спасибо тебе ещё раз , ты самая лучшая.. Нам очень повезло что мы встретили тебя..',
'Хочу выразить огромную благодарность Настеньке за той прекрасный вечер, который она нам подарила..еще задолго до нашей свадьбы мы с ней подружились и обговорили все до мелочей, так как мне и хотелось, и я была уверенна, что все пройдет отлично и мне и гостям все понравится... Очень позитивный человечек с массой идей, который очень любит свою работу и делают ее хорошо... всем своим друзьям и знакомым буду советовать только её как ведущую и с удовольствием приду на любой праздник с ее участием))',
'с полугодовым опозданием но все же)))Лучше поздно))) Наша свадьба была 9 августа. И собственно человека который проведет нашу свадьбу НЕ БЫЛО. Настеньку мы нашли за две недели или за неделю до свадьбы, даже и не помню. Как только пообщались с ней я поняла что только ОНА будет вести наш день. День свадьбы выдался очень волнительным, и когда мы зашли в банкетный зал я наконец-то расслабилась "гости в надежных руках". Зная своих гостей я отмечу, что среди них люди с высокими запросами в вопросах участия в подобных мероприятиях, люди которым "хватает пару стопок", меланхолики, стесняшки ... в общем весь набор. Настя нашла подход к каждому, и благодаря ей каждый гость оказался в центре внимания нас всех, что не может быть не приятно. Настя, до сих пор наши родные вспоминают тебя с улыбкой, а мы с благодарностью. Огромное спасибо от всей души)))позже скину фото, пока не получается загрузить их.',
'Наша свадьба состоялась 06.06.2014. Выражаем искреннюю благодарность молодой, зажигательной, симпатичной и опытной ведущей Анастасии! Она организовала и создала Атмосферу веселой и праздничной. Один интересный конкурс сменялся другим не менее интересным. Гости в восторге! Были удивлены необычными подарками! Очень талантливый диджей помогал поддерживать торжественную и радостную обстановку в течение всего праздника! Спасибо вам!)',
'На каких свадьбах я не была ни одна тамада мне не нравилась. На свадьбе должно быть весело ,а не скучно. У подруги намечалась свадьба думала что будет как обычно пьянка и танцы , но я глубоко ошибалась. Когда мы уже сидели за столом и Настена начала проводить праздник, я думала уйду на костылях . Было очень весело , что бы кто то просто сидел такого не было. Все гости принимали участия в конкурсах и играх , ни кто не сидел за столом. Настена спасибо тебе за классное настроение. Ты молодец, всю душу выложила на нас!!! И всем гостям очень понравилось. На свою свадьбу тебя позову))))',
'Настя, спасибо за интересное, креативное сопровождение и организацию нашего праздника - дня свадьбы! Было весело, задорно, позитивно!! Так держать, успехов!',
'Замечательная и позитивная Настя! Мы недавно состоявшейся семьей Крахмаль хотим выразить тебе огромную благодарность за прекрасную организацию и проведение нашей свадьбы!!! Так часто бывает, что первое впечатление и является самым верным и правильным, и в выборе нашего организатора и ведущей в одном лице это тоже сработало) Мы обратились к тебе первой и не прогадали!) Все прошло очень весело, душевно, именно так как мы хотели) Еще раз огромное спасибо за работу с нами, и частичку души, которую ты вкладываешь в праздник и торжество любящих сердец!!!',
'Наша свадьба была 12 сентября 2015 года!!!!!!!!!!Свадьба удалась!!!! Это несомненно Просто у нас была самая лучшая ведущая. Заводная , весёлая , общительная , добрая. Столько позитива было от неё. Дорогая наш тамада (Настюша), ты вела нашу свадьбу с веселой улыбкой на лице. Ты передавала заряд бодрости и веселья каждому гостю, каждому из нас. Даже вино в наших бокалах искрилось ярче от твоих слов. Благодаря твоим усилиям нам надарили целую кучу подарков, которые мы будем беречь и хранить. Все игры, проведенные тобой, доставили нам неописуемое удовольствие. Спасибо тебе за тот балаган, который ты устроила в нашу честь, за песни, за пляски, за игры и сказки. Подними с нами этот бокал вина, который мы хотим выпить в твою честь. Пусть он будет сладок, как твои речи, пусть он будет полным, как наше счастье, так выпей же с нами этот бокал.',
'Наша свадьба состоялась 04.07.2015. Она запомнится нам навсегда. Огромное спасибо нашей ведущей Анастасии,она замечательная тамада,мы и все наши гости остальсь в восторге от нашего праздника и нашей ведущей! Нстёнка мастер своего дела!!!! Молодец,удачи тебе во всех твоих талантах!!!!!!!!',
'Корпорация праздников и Анастасия Спасибо огромное за веселый, танцевальный и в то же время чудесный лирический вечер - 11.07.2015! Особенно порадовало то, что довольны остались все - и старшее поколение, и молодежь. Программа была организована таким образом, что гости успели и поесть, и потанцевать, и поучаствовать в интересных конкурсах. Благодаря Анастасии вечер для нас прошёл легко и весело. И самое главное, что помимо профессионализма и мастерства, Анастасия живой и искренний человек. Настя, мы очень рады,что обратились именно к тебе!!! Теперь будем приглашать тебя на другие семейные торжества!',
'Наша свадьба была 6 сентября 2014 года. К выбору ведущей я подошла ответственно, потому что от наших гостей можно было ожидать чего угодно!)) И выбрав Настю, не ошиблась. Было очень весело, на протяжении всего вечера у всех гостей было позитивное настроение. Ведущая провела множество конкурсов, в которые были вовлечены не только гости, но и мы с женихом. А самое важное, для меня, чего я боялась, когда "буйные" гости, изрядно выпив, начали бушевать, Настя сумела с ними справиться и разрешить конфликт. Свадьба была спасена!)) Да и вообще, мы с мужем остались очень довольны тем, что доверились Насте, веселились и радовались вместе гостями, не думая ни о чем. Спасибо за прекрасное и профессиональное проведение нашей свадьбы!)) Счастливая невеста Елена.',
'Мы хотели бы выразить огромную благодарность в организации и проведении нашей свадьбы. Это приятное торжество состоялось 8.04.2016. Это для нас не только День Рождения семьи, но и небольшой юбилей – 5 лет вместе. Мы в восторге от того, как чутко Анастасия подошла к своему делу и все мастерски организовала. В самом начале планирования у нас не стоял вопрос, кто будет ведущей на свадьбе. Наши хорошие знакомые так восторженно описывали свою свадьбу, которую проводила Анастасия, что мы сразу поняли – надо скорее звонить и договариваться о проведении :) На нас произвел впечатление индивидуальный подход и то, что Настасья учла все наши пожелания. Когда настал долгожданный день нашей свадьбы, мы ни разу не задумались и даже не переживали о том, как все пройдет. Праздник всем понравился – все гости остались в восторге, и мы вместе с ними. Никто не остался без внимания, а мы в свою очередь наслаждались торжеством. Ждем золотую свадьбу, чтобы так же весело ее отпраздновать. С благодарностью, Анастасия и Евгений Овсянниковы',
'Хочется поблагодарить такую позитивную, энергичную ведущую Анастасию Баженову и корпорацию праздников Баженовой! Наша свадьба состоялась 17 июля 2015 г, и проведение нашего торжества мы доверили ей, о чем совершенно не жалеем))) весь вечер пролетел незаметно, как на одном дыхании, было весело, интересно, а порою очень даже трогательно и романтично... Спасибо большое тебе Настенька за то что смогла нам организовать такой незабываемый праздник...',
'Спасибо огромное Корпорации праздников Баженовой за весёлую, динамичную свадьбу, которая состоялась 3.07.15г.Время пролетело незаметно для нас и гостей. Всё понравилось!!!Настя очень живая интересная организатор и ведущая! Отдельное спасибо за песочную церемонию и трогательную обстановку вечера!!!!Творческих успехов вашей корпорации!!!! Вот это правельно!',
'Корпорация праздников Анастасии Баженовой Выражаю вам искреннюю благодарность за нашу шикарную свадьбу! Вы меня удивили и покорили с первого раза!!! Не давали никому скучать на банкете, все гости остались довольны!!! Позаботилась обо всем!!! И огромное спасибо за проявленное терпение!!! Настя Ты самая лучшая!! Люблю тебя!!!',
'Наша свадьба состоялась 13.06.14. Из всех предложенных ведущих я сразу же, не задумываясь, выбрала Настю, и не прогадала) При первой встрече было понятно, что именно такому человеку я готова доверить свою свадьбу. Настя полностью прислушалась к моим пожеланиям, за что тебе, Насть, огромное СПАСИБО)) держала всех гостей постоянно в приподнятом настроении!!! даже язык никогда не повернётся назвать такую зажигалочку и весёлую ведущую - тамадой, это Ведущая с большой буквы)) все гости просто очарованы моим выбором)) никто не напился до состояния не вменяемости и не устали, как ни странно за 5 часов постоянных конкурсов и танцев :) Если мне надо будет провести какой-нибудь очередной праздник, я уже знаю к кому обращусь из ведущих)) Музыка подобрана была будто для нас, играли постоянно только всем известные и зажигательные мотивы, диджей хорошо постарался, за что ему отдельное спасибо! Еще хотелось бы выразить благодарность Насте за песочную церемонию, постоянно смотрю на эту красивую вазу, и воспоминания относят в тот замечательный день!))) Побольше тебе новых идей и весёлых молодых :)',
'Спасибо огромное Корпорации праздников и самой Анастасии за проведение нашей свадьбы. Все прошло чудесно и весело, некогда даже сильно наедаться было...)))0 Все танцевали , радовались, было много смеха и улыбок. Работе Настя отдается на все 100%, она очень харизматична, находчива, генерируеет десятки идей в минуту, у нее для всех свой подход. Творческого тебе процветания и благодарных клиентов',
'Хочется поблагодарить Анастасию за прекрасно проведенный и организованный праздник. Были учтены все наши пожелания. Праздник получился веселым, незабываемым и волшебным. Спасибо огромное Настенька за твою позитивность, энергичность. Все гости были в восторге и мы самое главное тоже!!'],
			reviewsChild: ['Настя, большое спасибо за праздник, который вы подарили моей дочке. Дети были очень довольны!!! Мне тоже все очень понравилось. Побольше вам новых клиентов!!!<br><br>Татьяна Драч',
'Огромное спасибо Корпорации праздников за проведение дня рождения моего сына Тимофея)))) Ребятне очень понравилось, все к ней тянулись как к родной))))) Молодец!!!!<br><br>Ольга Соколова',
'Мне очень понравилось, все отлично! Детям было интересно, старший в восторге! На следующий праздник опять позовем:)<br><br>Егошина Елена',
'Спасибо вам, изумительные дед мороз и снегурочка. Праздник для детей получился как из сказки, конкурсы интересные и это было так хорошо и весело.<br><br>Николаенко Анастасия',
'Благодарим за проведенное время с ребятишками!Им было очень весело и интересно, что даже после вашего ухода мы долго не могли их вернуть в реальность))) А утром на следующий день после праздника, именинница сказала мамочке Спасибо за такой замечательный День рождения,поэтому мы говорим спасибо Вам.<br><br>Инна Колесникова',
'Спасибо Корпорация праздников за такой замечательный детский праздник) Дети просто в восторге, прошло 3 дня,а дочка до сих пор думает,что у нее день рождения) , творческих вам успехов!!! на следующий праздник несомненно пригласим, только вас)<br><br>Мария Сухотская',
'Были сегодня на вечеринке Фиксиков) нам безумно понравилось! Сын был в восторге. Симка с Ноликом уделили внимание каждому ребенку, никто не остался в стороне. А пузыри стали яркой кульминацией праздника! Спасибо вам огромное!<br><br>Анна Багинская',
'Анастасия, огромное спасибо за интересный праздник, подаренный нашей дочке. Все гости и детки в восторге. Вы подарили детям радость, море улыбок, веселое настроение и яркие воспоминания о дне рождении.<br><br>Оксана Пучкина',
'Лунтик и Мила очень здорово провели праздник в День Роджение моей доченьки!!! Было забавно и весело!!! Нам очень очень понравилось)))))) Огромное Вам спасибо!!!<br><br>Марина Чудова',
'Спасибо большое корпорации праздников Анастасии Баженовой, было очень здорово! Теперь будем знать к кому обращаться за праздниками)<br><br>Екатерина Арсентьева',
'Спасибо большое Анастасия за праздник! Было ооочень круто! Ребятня и взрослые в восторге!<br><br>Яна Пузикова',
'Хочется сказать большое спасибо Анастасии и коллективу корпорации! 5 сентября, в день города ребята работали у нас на игротеке газеты "Читай!город". Очень порадовал основательный подход ко всему, начиная от переговоров и заканчивая игр с детками. У Анастасии для каждого персонажа своя особенная программа. Ребята работают с душой, очень зажигательно и ярко. Никто из детишек не остается безучастным. И хочется сказать, что народу было очень много, но это никак не повлияло на качество работы - довольны были все! С удовольствием будет работать снова!<br><br>Анастаси Телькова',
'Большое спасибо Анастасии и всему коллективу. Каждые выходные проводят у нас восхитительные развлекательные программы для детишек! В восторге остаются даже родители!<br><br>Страна Енотия',
'Не представляла, чем можно занять 9-леток, они же уже не маленькие, чтобы верить в героев, и многие игры им уже не интересны, взрослые же уже) Оказалось, Корпорация Праздников Анастасии Баженовой может справиться с любой задачей! Целый час нашим детям неотрывно было интересно)) Шерлок Холмс с помощницей-Индейцем решал с ними какие-то задачи, проводил конкурсы и что-то расследовал)) Немного вовлекли и засидевшихся за столом родителей. Понравилось с ними и нашей 2-летней дочке, она участвовала в конкурсах и даже впервые в жизни позволила нарисовать на себе аквагрим! Спасибо за праздник, успехов вам)<br><br>Елена Мерещак']
			}
		},
		computed: {
			reviews() {
				return this.$route.name === 'adult' ? this.reviewsAdult : this.reviewsChild
			}
		},
		methods: {
			next() {
            	this.$refs.slick.next();
	        },
	        prev() {
	            this.$refs.slick.prev();
	        },
		}
	}

</script>

<style lang="scss" scoped>
	
	section {
		height: 400px;
		&.adult {
			background: url("/img/main/bg1.jpg") top;
			background-color: #FDEEE9;
		}
		&>div {
			display: flex;
			justify-content: center;
		}
		h2 {
			color: #883589;
		}
		#review {
			margin-left: 20%;
			img {
				margin: 30px 0 0 50px;
				border-radius: 50%;
				float: left;
			}
			p {
				margin-left: 220px;
				width: 600px
			}
		}
	}

</style>